workspace/projects/039-dsp-project/results/20250103-033500-dsp-project-report.org
# #+TITLE: 2025-01-03 03:35:01
# #+AUTHOR: Yusuke Watanabe
# #+DATE: /home/ywatanabe/proj/llemacs/workspace/projects/039-dsp-project/results/20250103-033500-dsp-project-report.org


#+TITLE: LLEMACS DSP Project Report
#+DATE: 2025-01-03 03:34:24

* Project Overview
** Project Name
Dsp-Project

** Project Goals
- Write Digital Signal Processing Code For Demo EEG Signals
- Calculate DMD Features

** Project Status
TODO

* Project Directory Structure
** Root Directory
/home/ywatanabe/proj/llemacs/workspace/projects/039-dsp-project

** Subdirectories
- config/
- data/
- logs/
  - by_level/
    - debug.log
    - elisp.log
    - error.log
    - info.log
    - prompt.log
    - search.log
    - warn.log
  - logging.log
- pm/
  - pm.mmd
- README.md
- requirements.txt
- results/
- scripts/

* Project Management Flow
** Legend
- TODO
- In Progress
- Done
- Directory

** Project Structure
- Project Description
  - Project Name: Done
  - Project Goals: Done
  - Project Status: TODO
- Project Directory
  - Root Directory: Directory
  - config/: Directory
  - data/: Directory
  - scripts/: Directory
  - results/: Directory
  - resources/: Directory
  - .env/: Directory
  - .git/: Directory
  - requirements.txt/: Directory
  - Log.txt/: Directory
  - project_management.mmd: Directory

** Execution Flow
- Compile Context: TODO
- Generate Elisp: TODO
- Execute Elisp: TODO
- Success?: TODO
- Log Success: TODO
- Log Error: TODO
- Milestone?: TODO
- Git Commit: TODO
- Log Only: TODO
- Goal Met?: TODO
- Update Project_States: TODO

** Project Management Flow
- Milestone 1: Done
  - task1: Done
  - task2: Done
- Milestone 2: TODO
  - task1: TODO
  - task2: TODO

* Logs
** Debug Log
[[file:/home/ywatanabe/proj/llemacs/workspace/projects/039-dsp-project/logs/by_level/debug.log]]

** Elisp Log
[[file:/home/ywatanabe/proj/llemacs/workspace/projects/039-dsp-project/logs/by_level/elisp.log]]

** Error Log
[[file:/home/ywatanabe/proj/llemacs/workspace/projects/039-dsp-project/logs/by_level/error.log]]

** Info Log
[[file:/home/ywatanabe/proj/llemacs/workspace/projects/039-dsp-project/logs/by_level/info.log]]

** Prompt Log
[[file:/home/ywatanabe/proj/llemacs/workspace/projects/039-dsp-project/logs/by_level/prompt.log]]

** Search Log
[[file:/home/ywatanabe/proj/llemacs/workspace/projects/039-dsp-project/logs/by_level/search.log]]

** Warn Log
[[file:/home/ywatanabe/proj/llemacs/workspace/projects/039-dsp-project/logs/by_level/warn.log]]

* Conclusion
This report summarizes the current state of the DSP Project, including the project management flow, directory structure, and logs. The project is currently in the TODO state, with Milestone 1 completed and Milestone 2 pending.

* PDF
[[file:/home/ywatanabe/proj/llemacs/workspace/projects/039-dsp-project/results/20250103-033500-dsp-project-report.pdf]]