workspace/projects/039-dsp-project/results/20250103-033500-dsp-project-report.tex
% Created 2025-01-03 Fri 03:35
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Yusuke Watanabe}
\date{2025-01-03 03:34:24}
\title{LLEMACS DSP Project Report}
\hypersetup{
 pdfauthor={Yusuke Watanabe},
 pdftitle={LLEMACS DSP Project Report},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Project Overview}
\label{sec:orgbf06494}
\subsection{Project Name}
\label{sec:orga41cbb5}
Dsp-Project

\subsection{Project Goals}
\label{sec:orgecc1e59}
\begin{itemize}
\item Write Digital Signal Processing Code For Demo EEG Signals
\item Calculate DMD Features
\end{itemize}

\subsection{Project Status}
\label{sec:orgd015b1a}
TODO

\section{Project Directory Structure}
\label{sec:orgf99cc87}
\subsection{Root Directory}
\label{sec:org037a9c9}
/home/ywatanabe/proj/llemacs/workspace/projects/039-dsp-project

\subsection{Subdirectories}
\label{sec:orgdc9388b}
\begin{itemize}
\item config/
\item data/
\item logs/
\begin{itemize}
\item by\textsubscript{level}/
\begin{itemize}
\item debug.log
\item elisp.log
\item error.log
\item info.log
\item prompt.log
\item search.log
\item warn.log
\end{itemize}
\item logging.log
\end{itemize}
\item pm/
\begin{itemize}
\item pm.mmd
\end{itemize}
\item README.md
\item requirements.txt
\item results/
\item scripts/
\end{itemize}

\section{Project Management Flow}
\label{sec:org2c0be0d}
\subsection{Legend}
\label{sec:org568c535}
\begin{itemize}
\item TODO
\item In Progress
\item Done
\item Directory
\end{itemize}

\subsection{Project Structure}
\label{sec:org9224060}
\begin{itemize}
\item Project Description
\begin{itemize}
\item Project Name: Done
\item Project Goals: Done
\item Project Status: TODO
\end{itemize}
\item Project Directory
\begin{itemize}
\item Root Directory: Directory
\item config/: Directory
\item data/: Directory
\item scripts/: Directory
\item results/: Directory
\item resources/: Directory
\item .env/: Directory
\item .git/: Directory
\item requirements.txt/: Directory
\item Log.txt/: Directory
\item project\textsubscript{management.mmd}: Directory
\end{itemize}
\end{itemize}

\subsection{Execution Flow}
\label{sec:org20a797e}
\begin{itemize}
\item Compile Context: TODO
\item Generate Elisp: TODO
\item Execute Elisp: TODO
\item Success?: TODO
\item Log Success: TODO
\item Log Error: TODO
\item Milestone?: TODO
\item Git Commit: TODO
\item Log Only: TODO
\item Goal Met?: TODO
\item Update Project\textsubscript{States}: TODO
\end{itemize}

\subsection{Project Management Flow}
\label{sec:org3008ab4}
\begin{itemize}
\item Milestone 1: Done
\begin{itemize}
\item task1: Done
\item task2: Done
\end{itemize}
\item Milestone 2: TODO
\begin{itemize}
\item task1: TODO
\item task2: TODO
\end{itemize}
\end{itemize}

\section{Logs}
\label{sec:org0978a2a}
\subsection{Debug Log}
\label{sec:org71f983a}
\url{file:///home/ywatanabe/proj/llemacs/workspace/projects/039-dsp-project/logs/by\_level/debug.log}

\subsection{Elisp Log}
\label{sec:orgc3bab3d}
\url{file:///home/ywatanabe/proj/llemacs/workspace/projects/039-dsp-project/logs/by\_level/elisp.log}

\subsection{Error Log}
\label{sec:org373ac45}
\url{file:///home/ywatanabe/proj/llemacs/workspace/projects/039-dsp-project/logs/by\_level/error.log}

\subsection{Info Log}
\label{sec:orgee0dbd8}
\url{file:///home/ywatanabe/proj/llemacs/workspace/projects/039-dsp-project/logs/by\_level/info.log}

\subsection{Prompt Log}
\label{sec:orgdfb8c60}
\url{file:///home/ywatanabe/proj/llemacs/workspace/projects/039-dsp-project/logs/by\_level/prompt.log}

\subsection{Search Log}
\label{sec:orge4c1b29}
\url{file:///home/ywatanabe/proj/llemacs/workspace/projects/039-dsp-project/logs/by\_level/search.log}

\subsection{Warn Log}
\label{sec:org97d2ce9}
\url{file:///home/ywatanabe/proj/llemacs/workspace/projects/039-dsp-project/logs/by\_level/warn.log}

\section{Conclusion}
\label{sec:org5de0f95}
This report summarizes the current state of the DSP Project, including the project management flow, directory structure, and logs. The project is currently in the TODO state, with Milestone 1 completed and Milestone 2 pending.
\end{document}
